text = '(etnfづzxfk｡12dt◕`1ad‿6hns‿1zQY◕Cd$y｡FtSq)Ze6?づ#2)$'
print(text[::5])

"""
Задача 3 на 10 балов
Задачки для закрепления
1) Программа Выводит экран
Каждый 5й элемент последовательности.
'(etnfづzxfk｡12dt◕`1ad‿6hns‿1zQY◕Cd$y｡FtSq)Ze6?づ#2)$'
Уточнение:
Строка в кавычках, кавычки в данном случае не считаются элементом строки
"""
